gdgly/NUC97X_JS/STM32F4xx/DL698/RM_TASK_USER9xx.c
				case 3://DL/T698.45
/*
				//单相曲线抄读
					if(UARTCtrl->RMCSD[1]==1)
					{//ROAD
						OAD=UARTCtrl->RMCSD[2+0]<<24;
						OAD|=UARTCtrl->RMCSD[2+1]<<16;
						OAD|=UARTCtrl->RMCSD[2+2]<<8;
						OAD|=UARTCtrl->RMCSD[2+3];
						if(OAD==0x50020200)
						{//分钟冻结
							i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
							if(i>=1)
							{
								return 0;
							}
							id=UARTCtrl->TaskID;
							id=(id>>8)&0xff;//任务号
							i=UARTCtrl->MeterCount[id];//取档案号
							p8d=(u8*)ADDR_6000_SDRAM+(i*LENper_6000);
							p8d=Get_Element(p8d,2,8,0);//计算元素地址,使用ADDR_128KDATABUFF
							if(p8d==0)
							{
								return 0;
							}
							i=p8d[1];//取接线方式
							if(i==1)//未知（0），单相（1），三相三线（2），三相四线（3）
							{//单相,抄实时数据
								i=UARTCtrl->RMROADCount;//抄表CSD的ROAD内OAD计数(非DL698抄表时)
								x=UARTCtrl->RMCSD[6];
								UARTCtrl->RMCSDSubCountMax=1;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
								UARTCtrl->RMROADCountMax=x;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
								if(i>=x)
								{//抄表CSD子计数>=数组数
									return 0;//抄完
								}
								OAD=(UARTCtrl->RMCSD[7+(4*i)+0]<<24)+(UARTCtrl->RMCSD[7+(4*i)+1]<<16)+(UARTCtrl->RMCSD[7+(4*i)+2]<<8)+(UARTCtrl->RMCSD[7+(4*i)+3]<<0);
								switch(OAD)
								{
									case 0x20210200://1 冻结时标
										return 0;
									case 0x00100201://2 正向有功总电能
										break;
									case 0x00200201://3 反向有功总电能  
										break;
									case 0x00300200://4 组合无功1电能
										break;
									case 0x00400200://5 组合无功2电能
										break;
									case 0x00500201://6 一象限无功总电能
										break;
									case 0x00600201://7 二象限无功总电能
										break;
									case 0x00700201://8 三象限无功总电能
										break;
									case 0x00800201://9 四象限无功总电能
										break;
									case 0x20170200://10 有功需量
										break;
									case 0x20180200://11 无功需量
										break;
									case 0x20000200://12 电压
										break;										
									case 0x20000201://13 A相电压
										break;
									case 0x20010200://14 电流
										break;										
									case 0x20010201://15 A相电流
										break;
									case 0x20010400://16 零线电流
										break;
									case 0x20040200://17 有功功率
									case 0x20040202://18 A相有功功率
										break;
									case 0x20050200://19 无功功率
									case 0x20050202://20 A相无功功率
										break;
									case 0x200A0200://21 功率因数
									case 0x200A0202://22 A相功率因数
										break;
									case 0x11100201://23 冻结周期内正向有功最大需量 
										return 0;
									default:
										return 0;
								}
								UARTCtrl->RM_DI=OAD;
								return (u8*)1;
							}
							else
							{//三相，抄曲线冻结数据
								
							}
						}
					}
*/
				//
					x=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
					if(x)
					{//子计数!=0
						return 0;
					}
					UARTCtrl->RMROADCountMax=0;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
					UARTCtrl->RMCSDSubCountMax=0;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
					return (u8*)1;
				case 4://CJ/T 188-2004
					
					return 0;
			}
		case 2://事件采集方案
			i*=LENper_6016;
			i+=ADDR_6016_SDRAM;
			p8s=Get_Element((u8 *)i,2,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			i=p8s[3];//采集类型
			switch(i)
			{
				case 0://0	array ROAD	周期采集事件数据
					p8s+=4;
					break;
				case 1://1	NULL	根据通知采集所有事件数据
				case 2://2	array ROAD	根据通知采集指定事件数据
					//return 0;
					p8s+=4;
					break;
			}
			i=UARTCtrl->RMCSDCount;//抄表CSD计数
			x=Get_DL698ByteTypeLenValue(p8s+1);//得到DL698字节类型长度单元的值
			UARTCtrl->RMCSDCountMax=x;//抄表CSD最大个数
			if(i>=x)
			{//抄表CSD计数>=数组数
				return 0;
			}
			p8s=Get_Element(p8s,i+1,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			LEN_CSD=Get_DL698DataLen_S(p8s,0);//得到DL698数据类型长度(包括:类型字节和数据);入口:LENmax仅取NAND数据时先读到ADDR_128KDATABUFF用,返回:长度
			if(((LEN_CSD+1)>sizeof(UARTCtrl->RMCSD))||(LEN_CSD<6))
			{
				return 0;
			}
			//MR((u32)&UARTCtrl->RMCSD,(u32)p8s,LEN_CSD);
			//ROAD转为普通方案的RCSD格式，
			if(LEN_CSD)
			{
				LEN_CSD--;
			}
			UARTCtrl->RMCSD[0]=DataType_CSD;
			UARTCtrl->RMCSD[1]=1;
			MR(((u32)&UARTCtrl->RMCSD)+2,(u32)p8s+1,LEN_CSD);
		#if CompareMeterEventCount==1//全事件采集抄表是否比较发生次数:0=不比较(全部抄表数据写入文件),1=比较(只有次数变化的事件写入文件)
			RM_MeterEventAutoInc0x20220200(PORTn);//电能表事件抄读列选择若无发生次数(事件记录序号)则自动加入
		#endif
			x=UARTCtrl->RMprotocol;//抄表规约类型=未知 (0)，DL/T645-1997（1），DL/T645-2007（2），DL/T698.45（3），CJ/T 188-2004（4）
			switch(x)
			{
				default://未知 
					return 0;
				case 1://DL/T645-1997
					return 0;
				case 2://DL/T645-2007
					OAD=(UARTCtrl->RMCSD[2]<<24)|(UARTCtrl->RMCSD[3]<<16)|(UARTCtrl->RMCSD[4]<<8)|UARTCtrl->RMCSD[5];
					i=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
					UARTCtrl->RMCSDSubCountMax=2;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
					if(i>=2)
					{//抄表CSD子计数>=2
						return 0;
					}
					OAD=Get_Event645_DI(OAD,i);//获取当前的抄645表的数据项，OAD=事件OAD，index=当前OAD对应的第几个数据表示，从0开始，返回0=没有要抄读的数据标识
					if(OAD==0)
					{
						return 0;
					}
					UARTCtrl->RM_DI=OAD;
					UARTCtrl->RM_DI_N=0;
					return (u8*)1;
				case 3://DL/T698.45
					x=UARTCtrl->RMCSDSubCount;//抄表CSD子计数
					if(x)
					{//子计数!=0
						return 0;
					}
					UARTCtrl->RMROADCountMax=0;//抄表CSD的ROAD内有OAD最大个数(非DL698抄表规约库设定)
					UARTCtrl->RMCSDSubCountMax=0;//抄表CSD有子抄表个数(非DL698抄表规约库设定)
					return (u8*)1;
				case 4://CJ/T 188-2004
					
					return 0;
			}
		case 3://透明方案
//属性2（透明方案）∷=structure//删除时structure的数据单元清为0(NULL)
//{
//	方案编号     unsigned，
//	方案内容集   array 方案内容，
//	方案内容∷=structure
//	{
//		通信地址        	TSA，
//		开始前脚本id   	long-unsigned，
//		完成后脚本id   	long-unsigned，
//		方案控制标志  	structure，
//		{
//			上报透明方案结果并等待后续报文  bool，
//			等待后续报文超时时间（秒）      long-unsigned，
//			结果比对标识    enum{不比对（0），比（1），比对上报（2）}，
//			结果比对参数    structure
//			{
//				特征字节      unsigned，
//				截取开始      long-unsigned，
//				截取长度      long-unsigned
//			}
//		}
//		方案报文集 	 	array 方案报文
//		方案报文∷=structure
//		{
//			报文序号  unsigned，
//			报文内容  octet-string
//		}
//	}
//	存储深度     long-unsigned
//}
			i*=LENper_6018;
			i+=ADDR_6018;
			MR(ADDR_DATABUFF,i,7);
			p8s=(u8*)ADDR_DATABUFF;
			if(p8s[0]!=DataType_structure)
			{
				return 0;
			}
			id>>=8;
			id&=0xff;
			x=Get_DL698ByteTypeLenValue(p8s+5);//得到DL698字节类型长度单元的值
			if(UARTCtrl->MeterCount[id]>=x)
			{
				return 0;
			}
			p8s=Get_Element((u8*)(i+4),UARTCtrl->MeterCount[id]+1,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			//方案报文集
			p8s=Get_Element(p8s,5,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			i=UARTCtrl->RMCSDCount;
			x=Get_DL698ByteTypeLenValue(p8s+1);//得到DL698字节类型长度单元的值
			UARTCtrl->RMCSDCountMax=x;//抄表CSD最大个数
			if(i>=x)
			{
				return 0;
			}
			p8s=Get_Element(p8s,UARTCtrl->RMCSDCount+1,0,0);//计算元素地址,使用ADDR_128KDATABUFF
			if(p8s==0)
			{
				return 0;
			}
			return p8s+4;
		case 4://上报方案
		case 5://脚本方案
		default:
			return 0;
	}
}


#endif












